# Библиотека Pandas (Версия для Python 3)

## Data Frame

In [1]:
import pandas as pd

In [31]:
#создание DataFrame с помощью чтения данных из файла
frame = pd.read_csv('data_sample_example.tsv', header=0, sep='\t')

In [32]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [4]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [5]:
#изменение типа столбца с помощью функции apply
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [13]:
frame

              Name                Birth       City  Position
0      Иванов А.А.  1980-03-22 00:00:00     Москва       NaN
1     Сорокин И.В.  1965-07-08 00:00:00  Волгоград   инженер
2       Белов М.М.  1980-02-13 00:00:00     Ростов  менеджер
3  Мельникова Д.С.  1985-04-15 00:00:00     Ростов       NaN
4      Рыбина Е.П.  1985-11-19 00:00:00     Москва   инженер
5     Костров С.О.  1985-05-31 00:00:00     Москва    стажер
6            Perov               pizdec      Penza       NaN

In [7]:
new_line = {'Name':'Perov', 'Birth':'pizdec', 'City':'Penza'}

In [14]:
frame = frame.append(new_line, ignore_index=True)

In [45]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [15]:
frame

              Name                Birth       City  Position
0      Иванов А.А.  1980-03-22 00:00:00     Москва       NaN
1     Сорокин И.В.  1965-07-08 00:00:00  Волгоград   инженер
2       Белов М.М.  1980-02-13 00:00:00     Ростов  менеджер
3  Мельникова Д.С.  1985-04-15 00:00:00     Ростов       NaN
4      Рыбина Е.П.  1985-11-19 00:00:00     Москва   инженер
5     Костров С.О.  1985-05-31 00:00:00     Москва    стажер
6            Perov               pizdec      Penza       NaN
7            Perov               pizdec      Penza       NaN

In [16]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [18]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
Name        8 non-null object
Birth       8 non-null object
City        8 non-null object
Position    4 non-null object
dtypes: object(4)
memory usage: 336.0+ bytes

In [33]:
#заполнение пропущенных значений с помощью метода fillna
frame.fillna('разнорабочий')

              Name       Birth       City      Position
0      Иванов А.А.  22.03.1980     Москва  разнорабочий
1     Сорокин И.В.  07.08.1965  Волгоград       инженер
2       Белов М.М.  13.02.1980     Ростов      менеджер
3  Мельникова Д.С.  15.04.1985     Ростов  разнорабочий
4      Рыбина Е.П.  19.11.1985     Москва       инженер
5     Костров С.О.  31.05.1985     Москва        стажер

In [34]:
#заполнение пропущенных значений с помощью метода fillna (inplace)
frame.fillna('разнорабочий', inplace=True)

In [30]:
frame

              Name                Birth       City      Position
0      Иванов А.А.  1980-03-22 00:00:00     Москва  разнорабочий
1     Сорокин И.В.  1965-07-08 00:00:00  Волгоград       инженер
2       Белов М.М.  1980-02-13 00:00:00     Ростов      менеджер
3  Мельникова Д.С.  1985-04-15 00:00:00     Ростов  разнорабочий
4      Рыбина Е.П.  1985-11-19 00:00:00     Москва       инженер
7            Perov               pizdec      Penza  разнорабочий

In [35]:
frame.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [36]:
frame[['Position']]

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер
5        стажер

In [37]:
frame[['Name', 'Position']]

              Name      Position
0      Иванов А.А.  разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [26]:
frame.drop([5,6], axis=0, inplace=True)

In [38]:
frame[:3] #выбираем первые три записи

           Name       Birth       City      Position
0   Иванов А.А.  22.03.1980     Москва  разнорабочий
1  Сорокин И.В.  07.08.1965  Волгоград       инженер
2    Белов М.М.  13.02.1980     Ростов      менеджер

In [46]:
frame[-3:] #выбираем три послдение записи

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [40]:
frame.loc[[0,1,2], ["Name", "City"]] #работает на основе имен

           Name       City
0   Иванов А.А.     Москва
1  Сорокин И.В.  Волгоград
2    Белов М.М.     Ростов

In [41]:
frame.iloc[[1,3,5], [0,1]] #работает на основе позиций

              Name       Birth
1     Сорокин И.В.  07.08.1965
3  Мельникова Д.С.  15.04.1985
5     Костров С.О.  31.05.1985

In [42]:
frame.ix[[0,1,2], ["Name", "City"]]  #поддерживает и имена и позиции (пример с именами)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

           Name       City
0   Иванов А.А.     Москва
1  Сорокин И.В.  Волгоград
2    Белов М.М.     Ростов

In [43]:
frame.ix[[0,1,2], [0,1]] #поддерживает и имена и позиции (пример с позициями)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

           Name       Birth
0   Иванов А.А.  22.03.1980
1  Сорокин И.В.  07.08.1965
2    Белов М.М.  13.02.1980

In [47]:
#выбираем строки, которые удовлетворяют условию frame.Birth >= pd.datetime(1985,1,1)
frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [48]:
#выбираем строки, удовлетворяющие пересечению условий
frame[(frame.Birth >= pd.datetime(1985,1,1)) &
      (frame.City != 'Москва')]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий

In [49]:
#выбираем строки, удовлетворяющие объединению условий
frame[(frame.Birth >= pd.datetime(1985,1,1)) |
      (frame.City == 'Волгоград')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер